jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
/*  Copyright (c) 2010, Texas Instruments Incorporated
  * All rights reserved.
  * 
  * Redistribution and use in source and binary forms, with or without
  * modification, are permitted provided that the following conditions are met:
  *  * Redistributions of source code must retain the above copyright notice,
  *    this list of conditions, and the following disclaimer.
  *  * Redistributions in binary form must reproduce the above copyright 
  *    notice, this list of conditions and the following disclaimer in the
  *    documentation and/or other materials provided with the distribution.
  *  * Neither the name of the organization, Texas Instruments, nor the names 
  *    of its contributors may be used to endorse or promote products derived 
  *    from this software without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE 
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE 
  * ARE DISCLAIMED. IN NO EVENT SHALL TEXAS INSTRUMENTS BE LIABLE FOR ANY 
  * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
  * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
  * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
  * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF 
  * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  */
/**
  * @file       /otplatform/msp430f5/usb_cdc_driver/usb_main.c
  * @author     JP Norair
  * @version    R100
  * @date       1 Nov 2012
  * @brief      Main driver/MAC for USB  implementation
  * @ingroup    MSP430F5 USB CDC
  *
  * This module is a derivative work of TI's USB library file, usb.c.  JP has
  * optimized it to compile into less code by streamlining data alignment and 
  * other such tricks.  In addition, functionality supporting composite devices
  * is no longer supported.  The module is especially optimized to be a CDC
  * endpoint with 1 control endpoint, 1 bulk-in, and 1 bulk-out.
  * 
  * <PRE>
  * The revision history from the original TI codebase is shown below.
  * Source: usb.c, File Version 1.02 2010/06/17
  * Author: RSTO
  *
  * WHO         WHEN        WHAT                                          
  * ---         ----------  --------------------------------------------- 
  * RSTO        2008/09/03  born                                          
  * RSTO        2008/12/23  enhancements of CDC API                       
  * RSTO        2009/01/12  enhancements for USB serial number            
  * RSTO        2009/05/15  added USB_connectionState()                   
  * RSTO        2009/07/17  added __data16 qualifier for USB buffers      
  * RSTO        2009/08/04  workaround for PLL start up problem           
  * MSP,Biju    2009/10/20  Changes for composite support                 
  * RSTO        2009/10/21  updated USB_InitSerialStringDescriptor()      
  * RSTO        2009/11/05  updated USB_connectionState()                 
  * MSP,Biju    2010/07/15  Updated for MSC
  * ---         ----------  --------------------------------------------
  * JPN         2012/05/01  Integrated with OpenTag 0.3
  * JPN         2012/11/01  Integrated with OpenTag 0.4
  * </PRE>                           
  *****************************************************************************/

#include "OT_config.h"
#include "veelite.h"    //for getting device id

#include "msp430f5_lib.h"

#include "usb_cdc_driver/usb_device.h"
#include "usb_cdc_driver/usb_types.h"    //Basic Type declarations
#include "usb_cdc_driver/defMSP430USB.h"
#include "usb_cdc_driver/usb_main.h"      //USB-specific Data Structures
#include "usb_cdc_driver/usb_cdc_backend.h"
#include "usb_cdc_driver/usb_descriptors.h"

#ifdef _CDC_

//#include "HAL_UCS.h"
//#include "HAL_TLV.h"

//#include <string.h>

/*----------------------------------------------------------------------------+
 | Internal Constant Definition                                               |
 +----------------------------------------------------------------------------*/
#define NO_MORE_DATA    0xFFFF
#define EPBCT_NAK       0x80
#define EPCNF_TOGLE     0x20

#define DIRECTION_IN    0x80
#define DIRECTION_OUT   0x00

/*----------------------------------------------------------------------------+
 | Internal Variables                                                          |
 +----------------------------------------------------------------------------*/


//interface number
//static ot_u8 bInterfaceNumber;

//Set to 1 when USB device has been configured, set to 0 when unconfigured
//static ot_u8 bConfigurationNumber;

//static ot_u8 bHostAskMoreDataThanAvailable = 0;
//static ot_u8 bRemoteWakeup;

//ot_u16 wUsbEventMask;                 //used by USB_getEnabledEvents() and USB_setEnabledEvents()

//A buffer pointer to input end point 0 Data sent back to host is copied from
//this pointed memory location
//static ot_u8* pbIEP0Buffer;

//A buffer pointer to output end point 0 Data sent from host is copied to
//this pointed memory location
//static ot_u8* pbOEP0Buffer;

//For endpoint zero transmitter only Holds count of bytes remaining to be
//transmitted by endpoint 0.  A value of 0 means that a 0-length data packet
//A value of 0xFFFF means that transfer is complete

//For endpoint zero transmitter only Holds count of bytes remaining to be
//received by endpoint 0.  A value of 0 means that a 0-length data packet
//A value of 0xFFFF means that transfer is complete.



const tEDB* dbselect[] = { dblock_epin, dblock_epout };
                          
usbctl_struct usbctl;




void sub_reset_epdata(tEDB* edb, ot_u16* xbuf, ot_u8 count) {
    edb->bEPCNF     = EPCNF_USBIE | EPCNF_UBME | EPCNF_DBUF;
    edb->bEPBBAX    = (ot_u8)(((*xbuf++ - START_OF_USB_BUFFER) >> 3) & 0x00ff);
    edb->bEPBCTX    = count;
    edb->bEPBBAY    = (ot_u8)(((*xbuf - START_OF_USB_BUFFER) >> 3) & 0x00ff);
    edb->bEPBCTY    = count;
    edb->bEPSIZXY   = MAX_PACKET_SIZE;
}












ot_u8 usb_init (void) {
/// init Serial Number on debug or proto builds.  On release builds, it should
/// be burned into the FLASH during manufacturing/assembly
    ot_u16 bGIE;

    // atomic operation - disable interrupts
    bGIE = __get_SR_register() & GIE;   //save interrupt status
    __disable_interrupt();

#   if defined(__DEBUG__) || defined(__PROTO__)
    usbdesc_set_serialnum();
#   endif

    // configuration of USB module
    // To fix USB9 enumeration issue seen by Matrox
    USBKEYPID   = 0x9628;
    USBPWRCTL   = 0;
    USBPHYCTL   = PUSEL;                //use DP + DM as USB pins (not needed with external PHY on P9)
    USBPWRCTL   = VUSBEN + SLDOAON;     //enable primary and secondary LDO (3.3 and 1.8V)
    
    //wait some time for LDOs (5ms delay)
    platform_swdelay_ms(5);             
    
