jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
    USBPWRCTL   = VUSBEN + SLDOAON + VBONIE;    //enable interrupt VBUSon
    USBKEYPID   = 0x9600;                       //access to configuration registers disabled

    //wUsbEventMask     = 0;
    usbctl.status       = 0;

    //restore interrupt status
    __bis_SR_register(bGIE);
    return kUSB_succeed;
}






ot_u8 usb_enable () {
    //volatile unsigned int i;
    //volatile unsigned int j = 0;
    ot_int j = 0;
    ot_u16 pll_unsettled;

    // exit if USB Bandgap and VBUS not valid (error) --or--
    // exit if PLL is already enabled (success)
    if (!(USBPWRCTL & USBBGVBV))                    return kUSB_generalError;
    if ((USBCNF & USB_EN) && (USBPLLCTL & UPLLEN))  return kUSB_succeed;

    ///@todo Make sure that this function only gets called at power-on (seems like the case).
    ///      At power-on, OpenTag already configures XT2
    USBKEYPID   = 0x9628;
    USBPLLDIVB  = USB_XT_FREQ;                  //Settings desired frequency

#   if (USB_PLL_XT == 2)
        USBPLLCTL = UPCS0 + UPFDEN + UPLLEN;    //Select XT2 as Ref, PLL for USB, Discrim. on, enable PLL
#   else
        USBPLLCTL = UPFDEN + UPLLEN;            //Select XT1 as Ref, PLL for USB, Discrim. on, enable PLL
#   endif

    //Wait some time till PLL is settled
    // - Clear PLL IR and wait some time for settling
    // - Success if PLL IR stays 0 (no error flags go high)
    // - Try 10 times, and give-up if PLL IR will not settle after 10 tries
    do {
        USBPLLIR    = 0x0000;
#       ifdef __MSP430F6638
            platform_swdelay_us(1000); //1ms
#       else
            platform_swdelay_us(500);  //0.5ms
#       endif

        pll_unsettled = (USBPLLIR != 0);
    }
    while (pll_unsettled && (++j <= 10));

    USBCNF     |= !pll_unsettled;   //Enable USB if PLL settled (USB_EN = 0x0001)
    USBKEYPID   = 0x9600;

    return pll_unsettled;   //kUSB_succeed = 0, kUSB_generalError = 1
}





ot_u8 usb_disable (void) {
    USBKEYPID           = 0x9628;
    USBCNF   = 0;           //disable USB module
    USBPLLCTL      &= ~UPLLEN;      //disable PLL
    USBKEYPID       = 0x9600;
    usbctl.status   = 0;         //device is not enumerated
    return (kUSB_succeed);
}





//ot_u8 usb_setevents (ot_u16 events) {
//    wUsbEventMask = events;
//    return (kUSB_succeed);
//}





//ot_u16 usb_getevents () {
//    return (wUsbEventMask);
//}





ot_u8 usb_reset () {
    ot_u8 i;

    USBKEYPID = 0x9628;

    //reset should be on the bus after this!
    usbctl.intfnum  = 0;
    usbctl.confnum  = 0;             //device unconfigured
    usbctl.status   = 0;
    usbctl.flags    = 0;
    
    //FRSTE handling:
    //Clear FRSTE in the RESRIFG interrupt service routine before re-configuring USB control registers.
    //Set FRSTE at the beginning of SUSRIFG, SETUP, IEPIFG.EP0 and OEPIFG.EP0 interrupt service routines.
    USBCTL              = 0;        //Function Reset Connection disable (FRSTE)

    usbctl.bytes_ep0in  = NO_MORE_DATA;
    usbctl.bytes_ep0out = NO_MORE_DATA;
    usbctl.action       = ACTION_nothing;

    //The address reset normally will be done automatically during bus function reset
    USBFUNADR           = 0x00;     //Address 0 is the value for "unconfigured device"


    // Set settings for EP0
    //NAK both 0 endpoints and enable endpoint 0 interrupt
    dblock_ep0.bIEPBCNT = EPBCNT_NAK;
    dblock_ep0.bOEPBCNT = EPBCNT_NAK;
    dblock_ep0.bIEPCNFG = EPCNF_USBIE | EPCNF_UBME | EPCNF_STALL;    //8 byte data packet
    dblock_ep0.bOEPCNFG = EPCNF_USBIE | EPCNF_UBME | EPCNF_STALL;    //8 byte data packet

    USBOEPIE            = USB_OUTEP_INT_EN;
    USBIEPIE            = USB_INEP_INT_EN;
    i                   = usb_handle[0].edb_index;

    // Set settings for IEPx (double bufferring)
//    dblock_epin[i].bEPCNF   = EPCNF_USBIE | EPCNF_UBME | EPCNF_DBUF;   
//    dblock_epin[i].bEPBBAX  = (ot_u8)(((usb_handle[0].in_xbuf - START_OF_USB_BUFFER) >> 3) & 0x00ff);
//    dblock_epin[i].bEPBBAY  = (ot_u8)(((usb_handle[0].in_ybuf - START_OF_USB_BUFFER) >> 3) & 0x00ff);
//    dblock_epin[i].bEPBCTX  = EPBCNT_NAK;
//    dblock_epin[i].bEPBCTY  = EPBCNT_NAK;
//    dblock_epin[i].bEPSIZXY = MAX_PACKET_SIZE;
    sub_reset_epdata(&(dblock_epin[i]), (ot_u16*)&usb_handle[0].in_xbuf, EPBCNT_NAK);

    // Additional Mgmt interrupt end point for CDC
    // decrement index: Mgmt endpoint is one below Data
    //if (usb_handle[0].class == CDC_CLASS) { 
//    dblock_epin[i-1].bEPCNF   = EPCNF_USBIE | EPCNF_UBME | EPCNF_DBUF;
//    dblock_epin[i-1].bEPBBAX  = (ot_u8)(((usb_handle[0].irq_xbuf - START_OF_USB_BUFFER) >> 3) & 0x00ff);
//    dblock_epin[i-1].bEPBBAY  = (ot_u8)(((usb_handle[0].irq_ybuf - START_OF_USB_BUFFER) >> 3) & 0x00ff);
//    dblock_epin[i-1].bEPBCTX  = EPBCNT_NAK;
//    dblock_epin[i-1].bEPBCTY  = EPBCNT_NAK;
//    dblock_epin[i-1].bEPSIZXY = MAX_PACKET_SIZE;
    sub_reset_epdata(&(dblock_epin[i-1]), (ot_u16*)&usb_handle[0].irq_xbuf, EPBCNT_NAK);
    //}

    // Set settings for OEPx double buffering
//    dblock_epout[i].bEPCNF  = EPCNF_USBIE | EPCNF_UBME | EPCNF_DBUF ;
//    dblock_epout[i].bEPBBAX = (ot_u8)(((usb_handle[0].out_xbuf - START_OF_USB_BUFFER) >> 3) & 0x00ff);
//    dblock_epout[i].bEPBBAY = (ot_u8)(((usb_handle[0].out_ybuf - START_OF_USB_BUFFER) >> 3) & 0x00ff);
//    dblock_epout[i].bEPBCTX = 0x00;
//    dblock_epout[i].bEPBCTY = 0x00;
//    dblock_epout[i].bEPSIZXY= MAX_PACKET_SIZE;
    sub_reset_epdata(&(dblock_epout[i]), (ot_u16*)&usb_handle[0].out_xbuf, 0);

    usbcdc_reset_data();   //reset CDC specific data structures

    USBCTL      = FEN;                          //enable function
    USBIFG      = 0;                            //make sure no interrupts are pending
    USBIE       = SETUPIE | RSTRIE | SUSRIE;    //enable USB specific interrupts (setup, reset, suspend)
    USBKEYPID   = 0x9600;

    return kUSB_succeed;
}




/* Instruct USB module to make itself available to the PC for connection, by pulling PUR high.
 */
ot_u8 usb_connect () {
    USBKEYPID   = 0x9628;
    USBCNF     |= PUR_EN;   //Generate rising edge on DP -> the host, which
                            //enumerates our device as full speed device.
    USBPWRCTL  |= VBOFFIE;  //Enable interrupt VUSBoff
    USBKEYPID   = 0x9600;

    return (kUSB_succeed);
}




/* Force a disconnect from the PC by pulling PUR low.
 */
ot_u8 usb_disconnect () {
    USBKEYPID           = 0x9628;
    USBCNF             &= ~PUR_EN;  //disconnect pull up resistor - logical disconnect from HOST
    USBPWRCTL          &= ~VBOFFIE; //disable interrupt VUSBoff
    USBKEYPID           = 0x9600;
    usbctl.status       = 0;

    return (kUSB_succeed);
}




/* Force a remote wakeup of the USB host.
 */
ot_u8 usb_force_wakeup () {
    if ((usbctl.status & USB_STATUS_SUSPENDED) == 0) {   //device is not suspended
        return (kUSB_NotSuspended);
    }
    
