jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
    if (usbctl.flags & USB_FLAG_WAKEON) {
        //volatile unsigned int i;
        USBCTL |= RWUP;                 //USB - Device Remote Wakeup Request - this bit is self-cleaned
        return (kUSB_succeed);
    }
    
    return (kUSB_generalError);
}




/* Returns the status of the USB connection.
 */ 
ot_u8 usb_connection_info () {
    ot_u8 retval;

    //ot_u8 retval = 0;
    //if (USBPWRCTL & USBBGVBV)         retval |= kUSB_vbusPresent;
    //if (USBCNF & PUR_EN)              retval |= kUSB_purHigh;
    //if (usbctl.enum_status != 0)      retval |= kUSB_Enumerated;
    //if (usbctl.fn_suspended != FALSE) retval |= kUSB_suspended;
    //else                              retval |= kUSB_NotSuspended;
    
    // JP's version below: compiles smaller, runs faster
    retval  = (USBCNF & PUR_EN) << 1;                   //PUR_EN = 0x02, kUSB_purHigh = 0x40
    retval |= (usbctl.status & USB_STATUS_ENUMERATED);    //USB_FLAG_ENUMERATED = 2, kUSB_Enumerated = 0x20
    retval<<= 1;
    retval |= (usbctl.status & USB_STATUS_SUSPENDED)+1;   //kUSB_NotSuspended = 0x10, kUSB_NotSuspended = 0x08
    retval<<= 3;               
    retval |= ((USBPWRCTL & USBBGVBV) != 0);            //kUSB_vbusPresent = 0x01
    
    return retval;
}




/* Returns the state of the USB connection.
 */
ot_u8 usb_connection_state () {
    // JP's version below: compiles smaller, runs faster
    static const ot_u8 retval[16] = {
        // USBBGVBV not set
        ST_USB_DISCONNECTED, ST_USB_DISCONNECTED, ST_USB_DISCONNECTED, ST_USB_DISCONNECTED,
        ST_USB_DISCONNECTED, ST_USB_DISCONNECTED, ST_USB_DISCONNECTED, ST_USB_DISCONNECTED,
        
        // USBBGVBV set, PUR not set
        ST_USB_CONNECTED_NO_ENUM, ST_USB_CONNECTED_NO_ENUM,
        ST_USB_CONNECTED_NO_ENUM, ST_USB_CONNECTED_NO_ENUM,
        
        // USBBGVBV set, PUR set, enumeration not complete, not suspended
        ST_ENUM_IN_PROGRESS,
        
        // USBBGVBV set, PUR set, enumeration not complete, suspended
        ST_NOENUM_SUSPENDED,
        
        // USBBGVBV set, PUR set, enumeration complete, not suspended
        ST_ENUM_ACTIVE,
        
        // USBBGVBV set, PUR set, enumeration complete, suspended
        ST_ENUM_SUSPENDED
    };

    // 8 + 2 + (4 or 5 or 1)
    ot_u8 code = (USBPWRCTL & USBBGVBV) + (USBCNF & PUR_EN)<<1 + (usbctl.status);

    return retval[code];

    /*
    //If no VBUS present
    if (!(USBPWRCTL & USBBGVBV)){
        return (ST_USB_DISCONNECTED);
    }

    //If VBUS present, but PUR is low
    if ((USBPWRCTL & USBBGVBV) && (!(USBCNF & PUR_EN))){
        return (ST_USB_CONNECTED_NO_ENUM);
    }

    //If VBUS present, PUR is high, and enumeration is complete, and not suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (usbctl.enum_status == ENUMERATION_COMPLETE)
        && (!(usbctl.fn_suspended == TRUE))){
        return (ST_ENUM_ACTIVE);
    }

    //If VBUS present, PUR is high, and enumeration is NOT complete, and  suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (!(usbctl.enum_status == ENUMERATION_COMPLETE))
        && (usbctl.fn_suspended == TRUE)){
        return (ST_NOENUM_SUSPENDED);
    }

    //If VBUS present, PUR is high, and enumeration is complete, and  suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (usbctl.enum_status == ENUMERATION_COMPLETE)
        && (usbctl.fn_suspended == TRUE)){
        return (ST_ENUM_SUSPENDED);
    }

    //If VBUS present, PUR is high, but no enumeration yet
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (!(usbctl.enum_status == ENUMERATION_COMPLETE))){
        return (ST_ENUM_IN_PROGRESS);
    }

    return (ST_ERROR);
    */
}




ot_u8 usb_suspend (void) {
    usbctl.status  |= USB_STATUS_SUSPENDED;
    USBKEYPID       = 0x9628;                 //set KEY and PID to 0x9628 -> access to configuration registers enabled
    USBCTL         |= FRSTE;                    //Function Reset Connection Enable
    USBIFG         &= ~SUSRIFG;                 //clear interrupt flag
    USBPLLCTL      &= ~UPLLEN;

#   if (USB_DISABLE_XT_SUSPEND)
#       if (USB_PLL_XT == 2)
            UCSCTL6 |= XT2OFF;        //disable XT2
#       else
            UCSCTL6 |= XT1OFF;
#       endif
#   endif

    //Disable USB specific interrupts (setup, suspend, reset), enable resume.
    //If the reset occurred during device in suspend, the resume-interrupt will
    //come, after reset interrupt
    USBIE       = RESRIE;
    USBKEYPID   = 0x9600;

    return (kUSB_succeed);
}




ot_u8 usb_resume (void) {
    usb_enable();                           //enable PLL

    USBIFG         &= ~(RESRIFG | SUSRIFG);         //clear interrupt flags
    USBIE           = SETUPIE | RSTRIE | SUSRIE;    //enable USB specific interrupts (setup, reset, suspend)
    usbctl.status  &= ~USB_STATUS_SUSPENDED;
    
    return (kUSB_succeed);
}







void usbcmd_stall_ep0 (void) {
    dblock_ep0.bIEPCNFG |= EPCNF_STALL;
    dblock_ep0.bOEPCNFG |= EPCNF_STALL;
}


void usbcmd_stall_ep0out (void) {
    //in standard USB request, there is not control write request with data stage
    //control write, stall output endpoint 0
    //wLength should be 0 in all cases
    dblock_ep0.bOEPCNFG |= EPCNF_STALL;
}



void usbcmd_clear_ep0 (void) {
    dblock_ep0.bOEPBCNT = 0x00;
}



void usbcmd_txnext_ep0 (void) {
    // Base Case: set control action to nothing
    usbctl.action = ACTION_nothing;

    // First check if there are bytes remaining to be transferred
    // There is no MSP430 with more than 32KB of RAM, so casting to signed int
    // is not going to be an issue.
    if ((ot_int)usbctl.bytes_ep0in >= 0) {
        ot_int pkt_size;
        ot_u8* src_data;
    
        // Reduce the input endpoint by 8 bytes (control packet size)
        usbctl.bytes_ep0in -= EP0_PACKET_SIZE;
        
        // Set pkt_size to 8 (EP0_PACKET_SIZE) when there are 8 or more bytes.
        // else, set to the number of bytes left that are less than 8.
        pkt_size = ((ot_int)usbctl.bytes_ep0in < 0) ? \
                    (0 - (ot_int)usbctl.bytes_ep0in) : EP0_PACKET_SIZE;
        
        // Keep state as ACTION_data_in (1) if there is more data or if host 
        // requests too much data (overpull).  Else, go to ACTION_nothing (0)
        usbctl.action = ((ot_int)usbctl.bytes_ep0in >= 0) || (usbctl.flags & USB_FLAG_OVERPULL);
        
        // Set the ep0 bytes to <0 (NO MORE DATA) if usbctl.action == Nothing.
        // If ep0 bytes is already <0 from above, this doesn't affect anything.
        usbctl.bytes_ep0in -= (usbctl.action == ACTION_nothing);

        src_data            = usbctl.pbuf_ep0in;
        usbctl.pbuf_ep0in  += pkt_size;
        dblock_ep0.bIEPBCNT = pkt_size;
        platform_memcpy(abuf_ep0in, src_data, pkt_size);
    }
}




void usbcmd_tx_ep0 (ot_u8* pbBuffer) {
    ot_u16 scratch;
    usbctl.pbuf_ep0in   = pbBuffer;
    scratch             = dblock_setup.wLength;
    usbctl.flags       &= ~USB_FLAG_OVERPULL;

    //Limit transfer size to wLength if needed
    //this prevent USB device sending 'more than require' data back to host
    // The bit that is set is USB_FLAG_OVERPULL
    if (usbctl.bytes_ep0in < scratch) {
        usbctl.flags       |= USB_FLAG_OVERPULL;
        usbctl.bytes_ep0in  = scratch;
    }

    usbcmd_txnext_ep0();
}



