jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
void usbcmd_rxnext_ep0 (void) {
    ot_u8 bByte;

    bByte = dblock_ep0.bOEPBCNT & EPBCNT_BYTECNT_MASK;

    if (usbctl.bytes_ep0out >= (ot_u16)bByte) {
        platform_memcpy(usbctl.pbuf_ep0out, abuf_ep0out, bByte);

        //clear the NAK bit for next packet
        if (usbctl.bytes_ep0out > 0){
            usbctl.action = ACTION_data_out;
            usbcmd_clear_ep0();
            return;
        }
    }

    usbctl.action = ACTION_nothing;
    usbcmd_stall_ep0out();
}





void usbcmd_rx_ep0 (ot_u8* pbBuffer) {
    usbctl.pbuf_ep0out  = pbBuffer;
    usbctl.bytes_ep0out = dblock_setup.wLength;
    usbctl.action       = ACTION_data_out;
    usbcmd_clear_ep0();
}




void usbcmd_txzlp_ep0 (void) {
    dblock_ep0.bIEPBCNT = 0x00;
    usbctl.action       = ACTION_nothing;
    usbctl.bytes_ep0in  = NO_MORE_DATA;
}




inline CMD_RETURN sub_usbget(ot_u8 remaining_bytes, ot_u8* send_data) {
    usbctl.bytes_ep0in = remaining_bytes;
    usbcmd_clear_ep0();                                //for status stage
    usbcmd_tx_ep0(send_data);
    //return False;
}


CMD_RETURN usbcmd_get_cfg (void) {
    sub_usbget(1, (ot_u8*)&usbctl.confnum);
}

CMD_RETURN usbcmd_get_devdesc (void) {
    sub_usbget(SIZEOF_DEVICE_DESCRIPTOR, (ot_u8*)&usbdesc_device);
}

CMD_RETURN usbcmd_get_cfgdesc (void) {
    sub_usbget(sizeof(usbdesc_cfg), (ot_u8*)&usbdesc_cfg);
}




CMD_RETURN usbcmd_get_strdesc (void) {
/// To understand how this works, look at usbdesc_string[] in usb_descriptors.c
/// There are multiple strings in this descriptor, and they are organized by
/// LTV (length type value).  The cursor goes past each LTV item until it 
/// gets to the index specified from the host command request.
    ot_u8*  cursor;
    ot_int  str_i;
    str_i   = dblock_setup.wValue;
    cursor  = (ot_u8*)usbdesc_string;
    
    while (--str_i >= 0) {
        cursor += *cursor;
    }

    sub_usbget(*cursor, cursor);
}




CMD_RETURN usbcmd_get_intf (void) {
    //not fully supported, return one byte, zero
    usbctl.response[0] = 0x00;   //changed to report alternative setting byte
    usbctl.response[1] = usbctl.intfnum;
    
    sub_usbget(2, (ot_u8*)&usbctl.response[0]);
}




CMD_RETURN usbcmd_get_devstatus (void) {
    //if ((usbdesc_cfg.generic.attrs &
    //     CFG_DESC_ATTR_SELF_POWERED) == CFG_DESC_ATTR_SELF_POWERED) {
    //    usbctl.response[0] = DEVICE_STATUS_SELF_POWER;
    //}
    usbctl.response[0] = ((usbdesc_cfg.generic.attrs & CFG_DESC_ATTR_SELF_POWERED) != 0);

    //if (usbctl.flags & USB_FLAG_WAKEON){
    //    usbctl.response[0] |= DEVICE_STATUS_REMOTE_WAKEUP;
    //}
    usbctl.response[0] |= (usbctl.flags & USB_FLAG_WAKEON);

    //Return self power status and remote wakeup status
    sub_usbget(2, (ot_u8*)&usbctl.response[0]);
}




CMD_RETURN usbcmd_get_intfstatus(void) {
    //check bIndexL for index number (not supported)
    usbctl.response[0] = 0x00;   //changed to support multiple interfaces
    usbctl.response[1] = usbctl.intfnum;
    
    sub_usbget(2, (ot_u8*)&usbctl.response[0]);
}




CMD_RETURN usbcmd_get_epstatus (void) {
    ot_u8 ep_n;

    //Endpoint number is bIndexL
    ep_n = dblock_setup.wIndex & EP_DESC_ADDR_EP_NUM;
    if (ep_n == 0x00) {
        ot_u8* db0CNFG;
        db0CNFG             = ((ot_u8*)&dblock_ep0) + 3;
        db0CNFG            -= (dblock_setup.wIndex & EP_DESC_ADDR_DIR_IN) >> 6; //make 0x80 into 2 or 0
        usbctl.response[0]  = *db0CNFG & EPCNF_STALL;
    }
    
    //no response if endpoint is not supported.
    else if (ep_n <= MAX_ENDPOINT_NUMBER) {
        //EP is from EP1 to EP7 while C language start from 0
        //Firmware should NOT respond if specified endpoint is not supported. (chapter 8)
        tEDB* dblock;
        dblock              = (tEDB*)dbselect[(dblock_setup.wIndex&EP_DESC_ADDR_DIR_IN)==0];
        usbctl.response[0]  = dblock[--ep_n].bEPCNF & EPCNF_STALL;
    }
    
    usbctl.response[0] >>= 3; //STALL is on b3
    sub_usbget(2, (ot_u8*)&usbctl.response[0]);
}



CMD_RETURN usbcmd_set_address (void) {
    usbcmd_stall_ep0out();     //control write without data stage

    //bValueL contains device address
    if (dblock_setup.wValue < 128){
        //hardware will update the address after status stage
        //therefore, firmware can set the address now.
        USBFUNADR = dblock_setup.wValue;
        usbcmd_txzlp_ep0();
    }
    else {
        usbcmd_stall_ep0();
    }

    //return False;
}




CMD_RETURN usbcmd_set_cfg (void) {
    usbcmd_stall_ep0();        //control write without data stage

    //configuration number is in bValueL
    usbctl.confnum  = (ot_u8)dblock_setup.wValue;
    usbctl.status  |= (usbctl.confnum != 0) << 1;   //Set Enumeration

    //Send Zero Length Packet to complete configuration setup
    usbcmd_txzlp_ep0();

    //return False;
}



//Added by JP
void sub_eval_devfeature(ot_u8 enable_wakeon) {
    if (dblock_setup.wValue == FEATURE_REMOTE_WAKEUP) {
        usbctl.flags &= ~USB_FLAG_WAKEON;
        usbctl.flags |= enable_wakeon;
        usbcmd_txzlp_ep0();
    }
    else {
        usbcmd_stall_ep0();
    }
    //return False;
}


CMD_RETURN usbcmd_clear_devfeature (void) {
    sub_eval_devfeature(0);
}


CMD_RETURN usbcmd_set_devfeature (void) {
    sub_eval_devfeature(USB_FLAG_WAKEON);
}



//Added by JP
CMD_RETURN sub_prep_epfeature(ot_u8 clear_mask, ot_u8 set_mask) {
    ot_u8 ep_n;
    ep_n = (dblock_setup.wIndex & EP_DESC_ADDR_EP_NUM);
    
    if (ep_n <= MAX_ENDPOINT_NUMBER) {
        //EP is from EP1 to EP7 while C language start from 0
        //bIndexL contains endpoint number (Endpoint number is in low byte of wIndex)
        if (ep_n != 0) {
            tEDB* dblock;
            dblock                  = (tEDB*)dbselect[(dblock_setup.wIndex&EP_DESC_ADDR_DIR_IN)==0];
            dblock[--ep_n].bEPCNF  &= clear_mask;
            dblock[ep_n].bEPCNF    |= set_mask;
        }
    
        usbcmd_txzlp_ep0();
    }
    //return False;
}


CMD_RETURN usbcmd_clear_epfeature (void) {
    sub_prep_epfeature(~(EPCNF_STALL | EPCNF_TOGGLE), 0);
}



CMD_RETURN usbcmd_set_epfeature (void) {
    //wValue contains feature selector
    ///@todo see if this can be done via pre-processor
    if (dblock_setup.wValue == FEATURE_ENDPOINT_STALL){
        sub_prep_epfeature(~0, EPCNF_STALL);
    }

    usbcmd_stall_ep0();
    //return False;
}




CMD_RETURN usbcmd_set_intf (void) {
    //bValueL contains alternative setting
    //bIndexL contains interface number
    //change code if more than one interface is supported
    usbcmd_stall_ep0out();                         //control write without data stage
    usbctl.intfnum = dblock_setup.wIndex;
    usbcmd_txzlp_ep0();

    //return False;
}




