jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
CMD_RETURN usbcmd_invalid_request (void) {
    //check if setup overwrite is set
    //if set, do nothing since we might decode it wrong
    //setup packet buffer could be modified by hardware if another setup packet
    //was sent while we are deocding setup packet
    if ((USBIFG & STPOWIFG) == 0x00){
        usbcmd_stall_ep0();
    }

    //return False;
}







typedef void (*tpF)(void);

ot_u8 usbproc_parse_request (void) {
    ot_u8*  pb_reqlist;
    tpF     parse_fn;
    
    //point to beginning of the matrix
    pb_reqlist = (ot_u8*)&usbcmd_list[0];

    while (1) {
        ot_u8*  list_cursor;
        ot_u8   req_type;
        ot_u8   req_code;
        
        list_cursor = pb_reqlist;
        req_type    = *list_cursor++;
        req_code    = *list_cursor++;

        // No additional parsing for Input or Output requests of these types.
        if (((req_type & req_code) == 0xff) ||
            ((dblock_setup.bmRequestType & ~0x80) == (USB_REQ_TYPE_VENDOR | USB_REQ_TYPE_DEVICE))) {
            break;
        }

        if ((req_type == dblock_setup.bmRequestType) && (req_code == dblock_setup.bRequest)) {
            ot_u8*  setup_cursor    = (ot_u8*)&dblock_setup + 2;
            ot_u8   result          = 0x03;

            // first two bytes matched, compare the rest, 
            // break loop if byte 9 matches "checksum"
            while ((result & 0x80) == 0) {
                result<<=1;
                result |= (*setup_cursor++ == *list_cursor++);
            }
            if ((*list_cursor & result) == *list_cursor) {
                break;
            }
        }
        
        // Increment request list to next request
        pb_reqlist += sizeof(usbcmd_struct);
    }

    //if another setup packet comes before we have the chance to process current
    //setup request, we return here without processing the request
    //this check is not necessary but still kept here to reduce response(or simulation) time
    if ((USBIFG & STPOWIFG) != 0x00){
        //return (bWakeUp);
        return False;
    }

    //now we found the match and jump to the function accordingly.
    parse_fn = ((usbcmd_struct*)pb_reqlist)->pUsbFunction;

    //call function
    //bWakeUp = (*parse_fn)();
    parse_fn();

    //perform enumeration complete event:
    //when SetAddress was called and USBADDR is not zero
    if ((parse_fn == &usbcmd_set_address) && (USBFUNADR != 0)){
        //bWakeUp = usbevt_enumerate();
        return usbevt_enumerate();
    }

    //return bWakeUp;
    return False;
}




#endif

